tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm18/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
27222
(
(17.7905 0.227954 0)
(17.8286 0.220553 2.11562e-24)
(17.7263 0.10026 -7.91731e-24)
(17.8782 0.113404 0)
(17.8039 0.145867 4.84303e-23)
(17.7423 0.143925 6.42409e-23)
(17.8516 0.0931032 9.55256e-24)
(17.9051 0.129357 0)
...
)
;

boundaryField
{
    airfoil
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (18 0 0);
        value           uniform (18 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
