tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm18/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
27222
(
0.00328018
0.00323223
0.00345825
0.00335003
0.00310744
0.00358749
0.00349282
0.00330944
...
)
;

boundaryField
{
    airfoil
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    freestream
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           uniform 0.005;
    }
    outlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           uniform 0.005;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
