tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm18/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
27222
(
179.644
179.642
179.641
179.643
179.643
179.651
179.643
179.669
...
)
;

boundaryField
{
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 615;
    }
    freestream
    {
        type            freestream;
        freestreamValue uniform 180;
        value           uniform 180;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 180;
        value           uniform 180;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
