tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm18/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
27222
(
104941
104225
104125
103486
105732
102528
103814
104628
...
)
;

boundaryField
{
    airfoil
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101000;
    }
    freestream
    {
        type            freestreamPressure;
        freestreamValue uniform 101000;
        value           uniform 101000;
    }
    outlet
    {
        type            zeroGradient;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
