tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm18/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

interpolationSchemes
{
    default             linear;
}

divSchemes
{
    default             none;
    div(rhoPhi,U)       Gauss linearUpwind grad(U);
    div(phi,omega)      Gauss linearUpwind grad(omega);
    div(phi,k)          Gauss linearUpwind grad(k);
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

gradSchemes
{
    default             Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited corrected 0.5;
}

snGradSchemes
{
    default             limited corrected 0.5;
}


wallDist
{
    method          meshWave;
}

// ************************************************************************* //
